Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.PropertyFileDirectories Property
 The directories where to look for property files.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> PropertyFileDirectories { get; set; }
Public Shared Property PropertyFileDirectories As List(Of String)
	Get
	Set
Property Value
Type: List<String>
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace